.emacs.d/config.org
#+TITLE: Fernando Pe単a's Emacs configuration
#+OPTIONS: toc:4 H:4
#+STARTUP: content indent
#+PROPERTY: header-args:emacs-lisp :tangle "~/.emacs.d/init.el"

* About this file
This is my Emacs config file. It's written in the literate programming style in
Org Mode. It's very convenient for organizing the code in sections and
commenting each block.

This file is inspired on Sacha Chua's Emacs configuration: [[http://pages.sachachua.com/.emacs.d/Sacha.html]]

To tangle the code blocks into a new ~init.el~ file after making some changes,
use =C-c C-v t= (~org-babel-tangle~).

* Starting up
** Custom startup directory
This file is symlinked, so tell emacs not to start in the actual directory of
the file.

#+BEGIN_SRC emacs-lisp
(setq default-directory "~/")
#+END_SRC

** Initialize package and add package archives

#+BEGIN_SRC emacs-lisp
  (package-initialize)
  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/"))

  (eval-when-compile
    (require'use-package))

  (setq use-package-always-ensure t)
#+END_SRC

** Customize
Configure the file to to store customize settings. I prefer using =setq= instead
of customize because I find it easier to organize, but when I use it, it stores
the settings in the next file.

#+BEGIN_SRC emacs-lisp
(setq custom-file "~/.emacs.d/.emacs-custom.el")
(load custom-file)
#+END_SRC

** Disable splash screen

#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-screen t)
#+END_SRC

** Menu bar, toolbar and scroll bar
Disable/enable menu bar (on Linux) and toolbar.

Disable scroll bar.

#+BEGIN_SRC emacs-lisp
(menu-bar-mode 1)
(tool-bar-mode -1)
(toggle-scroll-bar -1)
#+END_SRC

** Change Emacs cursor to bar

#+BEGIN_SRC emacs-lisp
(setq-default cursor-type 'bar)
#+END_SRC

** Set font

#+BEGIN_SRC emacs-lisp :tangle no
(set-default-font "Monaco-12")
#+END_SRC

** PATH variable
Make emacs PATH variable equal to user's shell PATH

#+BEGIN_SRC emacs-lisp
(use-package exec-path-from-shell
  :ensure t
  :config
  (exec-path-from-shell-initialize))
#+END_SRC

** Load secrets
I keep sensitive information in a separate file.

#+BEGIN_SRC emacs-lisp
(load "~/Library/Mobile Documents/com~apple~CloudDocs/emacs/.emacs.secrets" t)
#+END_SRC

** Global key changes
Change al key to meta for Emacs Mac.

#+BEGIN_SRC emacs-lisp
  (setq mac-option-modifier 'meta)
#+END_SRC

Remap =RET= key to ~newline-and-indent~ to indent the line when pressing =RET=
and start next line with correct indentation.
The ~newline~ function is rebounded =<C-return>=.

#+BEGIN_SRC emacs-lisp
  (define-key global-map (kbd "RET") 'newline-and-indent)
  (define-key global-map (kbd "<C-return>") 'newline)
#+END_SRC

Translate =単= key.

#+begin_src emacs-lisp
  (define-key key-translation-map (kbd "M-単") (kbd "M-;"))
  (define-key key-translation-map (kbd "C-単") (kbd "C-;"))
#+end_src

Better default keybindings.

#+begin_src emacs-lisp
  (global-set-key (kbd "M-/") 'hippie-expand)
  (global-set-key (kbd "C-x C-b") 'ibuffer)
  (global-set-key (kbd "M-z") 'zap-up-to-char)

  (global-set-key (kbd "C-s") 'isearch-forward-regexp)
  (global-set-key (kbd "C-r") 'isearch-backward-regexp)
  (global-set-key (kbd "C-M-s") 'isearch-forward)
  (global-set-key (kbd "C-M-s") 'isearch-backward)
#+end_src

Press middle button (=<mouse-2>=) with two button mouse

#+BEGIN_SRC emacs-lisp
(define-key key-translation-map (kbd "<S-mouse-1>") (kbd "<mouse-2>"))
#+END_SRC

** Disable bell

#+begin_src emacs-lisp
  (setq visible-bell nil
        ring-bell-function #'ignore)
#+end_src

* Evil Mode
:PROPERTIES:
:header-args:emacs-lisp: :tangle no
:END:

I'm using Evil Mode because like Vim keybindings. However, there are some
inconsistencies across differente modes, so maybe I'll start using Emacs default
ones.

** Configure Evil Mode

#+BEGIN_SRC emacs-lisp
  (use-package evil
    :ensure t
    :init
    (setq evil-want-C-u-delete t)
    (setq evil-want-C-u-scroll t)
    (setq evil-shift-width 4)
    (setq evil-echo-state nil)
    ;; evil-collection assumes evil-want-keybinding is set to nil and
    ;; evil-want-integration is set to t before loading evil
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    :config
    (evil-mode 1))
#+END_SRC

** Configure Evil Commentary
Configure =evil-commentary= package for commenting more easily.  The command
=gc= acceps a motion object and it comments it. To comment a line, use =gcc=.

#+BEGIN_SRC emacs-lisp
(use-package evil-commentary
  :ensure t
  :config
  (evil-commentary-mode))
#+END_SRC

** Configure Evil Collection
It is a collection of Evil bindings for the parts that Evil don't cover by
default, such as =help-mode=, =M-x calendar=, ...

#+BEGIN_SRC emacs-lisp
  (use-package evil-collection
    :after evil
    :ensure t
    :config
    ;; Load all bindings
    (evil-collection-init))
#+END_SRC

** Configure Evil Surround
Emulation of =surround.vim= by Tim Pope.

#+BEGIN_SRC emacs-lisp
  (use-package evil-surround
    :ensure t
    :config
    (global-evil-surround-mode 1))
#+END_SRC

** Configure Evil Org Mode
Supplemental keybindings =evil-mode= keybindings to =org-mode=

#+BEGIN_SRC emacs-lisp
  (use-package evil-org
    :ensure t
    :after org
    :config
    (add-hook 'org-mode-hook 'evil-org-mode)
    (add-hook 'evil-org-mode-hook
              (lambda ()
                (evil-org-set-key-theme)))
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))
#+END_SRC

* General configuration
** Reload Emacs Configuration
Reload my Emacs configuration file

#+BEGIN_SRC emacs-lisp
  (defun my/reload-emacs-configuration ()
    (interactive)
    (load-file "~/.emacs.d/init.el"))
#+END_SRC

** Color Theme
Themes are loaded using customize.

Gruvbox 

#+begin_src emacs-lisp
  (use-package gruvbox-theme
    :ensure t)
#+end_src

** Modifier keys configuration
I no longer use these, I'm using Karabiner Elements for modifying modifier keys
mappings.

#+BEGIN_SRC emacs-lisp :tangle no
(setq mac-command-modifier 'control)
#+END_SRC

** Parens and pair characters
Highlight matching parens.

#+BEGIN_SRC  emacs-lisp
(show-paren-mode 1)
(setq show-paren-delay 0)
#+END_SRC

Activate =electric-pair-mode= for inserting automatically matching pair
character.
#+BEGIN_SRC emacs-lisp
(electric-pair-mode 1)
#+END_SRC

Use =rainbow-delimiters= package. Highlights parens, brackets and braces
acording to their depth.

#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :ensure t
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
#+END_SRC

** Line numbers
Enable =display-line-numbers-mode= on programming modes. To avoid shiftings
lateral effects when scrolling throught the buffer. I set
=display-line-numbers-width= to one more than the necessary when the buffer has
80-99 lines.

#+BEGIN_SRC emacs-lisp
  (setq display-line-numbers-grow-only t)
  ;; (setq display-line-numbers-width-start t)
  ;; Make the left fringe smaller
  ;; (fringe-mode '(1 . 4))

  (defun calculate-width (n)
    "Calculate width in O(1) time"
    (let ((width
      (if (< n 1)
          1
        (+ 1 (floor (/ (log n) (log 10)))))))

      (if (and (>= n 80) (<= n 99))
          (1+ width)
        width)))

  (defun my-display-line-numbers-mode-hook ()
    (setq-local display-line-numbers-width (calculate-width (count-lines (point-max) (point-min)))))
  (add-hook 'display-line-numbers-mode-hook #'my-display-line-numbers-mode-hook)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)
#+END_SRC
 
** Whitespace
Show whitespace at the end of the line.

#+BEGIN_SRC emacs-lisp :tangle no
(setq-default show-trailing-whitespace t)
(add-hook 'shell-mode-hook (lambda ()
                  (setq show-trailing-whitespace nil)))
#+END_SRC

Indicate empty lines at the end of the buffer.

#+BEGIN_SRC emacs-lisp
(setq-default indicate-empty-lines t)
#+END_SRC

** Backups
Save all backup files in the same directory, so they don't appear everywhere :)

#+BEGIN_SRC emacs-lisp
  (unless backup-directory-alist
    (setq backup-directory-alist `(("." . ,(concat user-emacs-directory "backups")))))
#+END_SRC

Backups settings.

#+BEGIN_SRC emacs-lisp
  (setq delete-old-versions -1)
  (setq version-control t)
  (setq vc-make-backup-files t)
  (setq auto-save-file-name-transforms `((".*" ,(concat user-emacs-directory "auto-save-list") t)))
#+END_SRC

** Ido Mode and Smex
*** Activate Ido Mode.

#+BEGIN_SRC emacs-lisp
  (setq ido-enable-flex-matching t)
  (setq ido-everywhere t)
  (ido-mode 1)
#+END_SRC

Set Find File At Point, so Ido suggests the file which name is under the cursor

#+BEGIN_SRC emacs-lisp
  (setq ido-use-filename-at-point 'guess)
#+END_SRC

Give permission to create new buffers without asking

#+BEGIN_SRC emacs-lisp
  (setq ido-create-new-buffer 'always)
#+END_SRC

set order of suggestions in the minibuffer

#+BEGIN_SRC emacs-lisp
  (setq ido-file-extensions-order '( ".org" ".txt" ".py" ".emacs" ".xml" ".el"
                                     ".ini" ".cfg" ".cnf"))
#+END_SRC

*** Activate Smex. It's like Ido mode for M-x

#+BEGIN_SRC emacs-lisp
  (use-package smex
    :ensure t
    :config
    (global-set-key (kbd "M-x") 'smex)
    (global-set-key (kbd "M-X") 'smex-major-mode-commands)
    ;; This is your old M-x.
    (global-set-key (kbd "C-c C-c M-x") 'execute-extended-command))
#+END_SRC

** Windows
*** Faster switching between windows in the same frame using S + arrow keys

#+BEGIN_SRC emacs-lisp
  (windmove-default-keybindings)
#+END_SRC

*** Go to previous other window
This function is complementary to =other-window=.

#+BEGIN_SRC emacs-lisp
(defun other-window-backward ()
  "Goto previous window"
  (interactive)
  (other-window -1))
(global-set-key (kbd "\C-x p") 'other-window-backward)
#+END_SRC

*** Close and kill next pane
This function is complementary to =kill-buffer-and-window=.

#+begin_src emacs-lisp
  (defun other-kill-buffer-and-window ()
    "If there are multiple windows, close the other window and kill the buffer in it also."
    (interactive)
    (other-window 1)
    (kill-buffer-and-window))
  (global-set-key (kbd "\C-x 4 o") 'other-kill-buffer-and-window)
#+end_src

** Disabled commands
Enable Emacs disable commands.

#+BEGIN_SRC emacs-lisp
(setq disabled-command-function nil)
#+END_SRC

** Undo Tree
Undo Tree let's you use =C-x u= (=undo-tree-visualize=) to see the undo tree for
the current buffer and undo to a certain point.

#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :ensure t
  :config
  (global-undo-tree-mode)
  (setq undo-tree-visualizer-timestamps t)
  (setq undo-tree-visualizer-diff t))
#+END_SRC

** Change "yes or no" to "y or n"
I'm too lazy to write =yes= or =no=.

#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

** End sentences with single space

#+BEGIN_SRC emacs-lisp
  (setq sentence-end-double-space nil)
#+END_SRC

** Move to trash when deleting

#+begin_src emacs-lisp
  (when (string-equal system-type "darwin")
    (setq delete-by-moving-to-trash t)
    (setq trash-directory "~/.Trash"))
#+end_src

* Global editing configuration
** Indentation
Set indentation width to 4.

#+BEGIN_SRC emacs-lisp
(setq-default tab-width 4)
(setq-default c-basic-offset 4)
#+END_SRC

Indent using spaces

#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
#+END_SRC

TAB tries to indent the current line, and if the line was already indented, then
tries to complete the thing at point

#+begin_src emacs-lisp
  (setq tab-always-indent 'complete)
#+end_src

** Replace when writing over selection

#+BEGIN_SRC emacs-lisp
(delete-selection-mode 1)
#+END_SRC

** Remember cursor position in buffer when saving file

#+BEGIN_SRC emacs-lisp
(save-place-mode 1)
#+END_SRC
    
** Wrap text to words

#+BEGIN_SRC emacs-lisp
(global-visual-line-mode t)
#+END_SRC

