.emacs.d/init.el
(setq default-directory "~/")

(package-initialize)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))

(eval-when-compile
  (require'use-package))

(setq use-package-always-ensure t)

(setq custom-file "~/.emacs.d/.emacs-custom.el")
(load custom-file)

(setq inhibit-startup-screen t)

(menu-bar-mode 1)
(tool-bar-mode -1)
(toggle-scroll-bar -1)

(setq-default cursor-type 'bar)

(use-package exec-path-from-shell
  :ensure t
  :config
  (exec-path-from-shell-initialize))

(load "~/Library/Mobile Documents/com~apple~CloudDocs/emacs/.emacs.secrets" t)

(setq mac-option-modifier 'meta)

(define-key global-map (kbd "RET") 'newline-and-indent)
(define-key global-map (kbd "<C-return>") 'newline)

(define-key key-translation-map (kbd "M-ñ") (kbd "M-;"))
(define-key key-translation-map (kbd "C-ñ") (kbd "C-;"))

(global-set-key (kbd "M-/") 'hippie-expand)
(global-set-key (kbd "C-x C-b") 'ibuffer)
(global-set-key (kbd "M-z") 'zap-up-to-char)

(global-set-key (kbd "C-s") 'isearch-forward-regexp)
(global-set-key (kbd "C-r") 'isearch-backward-regexp)
(global-set-key (kbd "C-M-s") 'isearch-forward)
(global-set-key (kbd "C-M-s") 'isearch-backward)

(define-key key-translation-map (kbd "<S-mouse-1>") (kbd "<mouse-2>"))

(setq visible-bell nil
      ring-bell-function #'ignore)

(defun my/reload-emacs-configuration ()
  (interactive)
  (load-file "~/.emacs.d/init.el"))

(use-package gruvbox-theme
  :ensure t)

(show-paren-mode 1)
(setq show-paren-delay 0)

(electric-pair-mode 1)

(use-package rainbow-delimiters
  :ensure t
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

(setq display-line-numbers-grow-only t)
;; (setq display-line-numbers-width-start t)
;; Make the left fringe smaller
;; (fringe-mode '(1 . 4))

(defun calculate-width (n)
  "Calculate width in O(1) time"
  (let ((width
    (if (< n 1)
        1
      (+ 1 (floor (/ (log n) (log 10)))))))

    (if (and (>= n 80) (<= n 99))
        (1+ width)
      width)))

(defun my-display-line-numbers-mode-hook ()
  (setq-local display-line-numbers-width (calculate-width (count-lines (point-max) (point-min)))))
(add-hook 'display-line-numbers-mode-hook #'my-display-line-numbers-mode-hook)

(add-hook 'prog-mode-hook #'display-line-numbers-mode)

(setq-default indicate-empty-lines t)

(unless backup-directory-alist
  (setq backup-directory-alist `(("." . ,(concat user-emacs-directory "backups")))))

(setq delete-old-versions -1)
(setq version-control t)
(setq vc-make-backup-files t)
(setq auto-save-file-name-transforms `((".*" ,(concat user-emacs-directory "auto-save-list") t)))

(setq ido-enable-flex-matching t)
(setq ido-everywhere t)
(ido-mode 1)

(setq ido-use-filename-at-point 'guess)

(setq ido-create-new-buffer 'always)

(setq ido-file-extensions-order '( ".org" ".txt" ".py" ".emacs" ".xml" ".el"
                                   ".ini" ".cfg" ".cnf"))

(use-package smex
  :ensure t
  :config
  (global-set-key (kbd "M-x") 'smex)
  (global-set-key (kbd "M-X") 'smex-major-mode-commands)
  ;; This is your old M-x.
  (global-set-key (kbd "C-c C-c M-x") 'execute-extended-command))

(windmove-default-keybindings)

(defun other-window-backward ()
  "Goto previous window"
  (interactive)
  (other-window -1))
(global-set-key (kbd "\C-x p") 'other-window-backward)

(defun other-kill-buffer-and-window ()
  "If there are multiple windows, close the other window and kill the buffer in it also."
  (interactive)
  (other-window 1)
  (kill-buffer-and-window))
(global-set-key (kbd "\C-x 4 o") 'other-kill-buffer-and-window)

(setq disabled-command-function nil)

(use-package undo-tree
  :ensure t
  :config
  (global-undo-tree-mode)
  (setq undo-tree-visualizer-timestamps t)
  (setq undo-tree-visualizer-diff t))

(fset 'yes-or-no-p 'y-or-n-p)

(setq sentence-end-double-space nil)

(when (string-equal system-type "darwin")
  (setq delete-by-moving-to-trash t)
  (setq trash-directory "~/.Trash"))

(setq-default tab-width 4)
(setq-default c-basic-offset 4)

(setq-default indent-tabs-mode nil)

(setq tab-always-indent 'complete)

(delete-selection-mode 1)

(save-place-mode 1)

(global-visual-line-mode t)
