.emacs.d/config.org
** Apropos search more extensively

#+begin_src emacs-lisp
  (setq apropos-do-all t)
#+end_src

** Highlight current line

#+BEGIN_SRC emacs-lisp :tangle no
(global-hl-line-mode t)
#+END_SRC

** Spell checking
Set Hunspell as spell checking engine and configure it to use English and
Spanish dictionaries

*** How to install dictionaries in Hunspell
First, install Hunspell from the command line:

#+BEGIN_SRC bash
brew install hunspell
#+END_SRC

Then, download the dictionaries from here:
https://github.com/LibreOffice/dictionaries
or from the OpenOffice Extensions page:
https://extensions.openoffice.org

Move the dictionary =.aff= and =.dic= files to the =~/Library/Spelling/=
directory to install them. =oxt= files are compressed with =zip=, so they can be
decompressed easily to get the files.

You can see al the available dictionaries with:

#+BEGIN_SRC bash
hunspell -D
#+END_SRC

An test if Hunspell can open them with:

#+BEGIN_SRC bash
hunspell -d <dict1>,<dict2>,...
#+END_SRC

*** First try
[[https://emacs.stackexchange.com/questions/21378/spell-check-with-multiple-dictionaries]]

#+BEGIN_SRC emacs-lisp :tangle no
  (with-eval-after-load "ispell"
    (setq ispell-program-name "hunspell")
    (setq ispell-dictionary "es_ES,en_US")
    ispell-set-spellchecker-params has to be called
    before ispell-hunspell-add-multi-dic will work
    (ispell-set-spellchecker-parames)
    (ispell-hunspell-add-multi-dic "es_ANY"))
#+END_SRC

*** Second try
https://emacs.stackexchange.com/questions/48755/flyspell-does-not-start-form-the-first-try

#+BEGIN_SRC emacs-lisp
  (setq ispell-program-name "hunspell")
  ;; you could set `ispell-dictionary` instead but `ispell-local-dictionary' has higher priority
  (setq ispell-dictionary "en_US,es_ES")
  ;; (setq ispell-local-dictionary "en_US,es_ES")
  (setq ispell-hunspell-dictionary-alist '(("en_US,es_ES" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US,es_ES") nil utf-8)))
#+END_SRC

*** Enable flyspell in text-mode
But disable it in change-log-mode and log-edit-mode. They are text-mode
children.

#+BEGIN_SRC emacs-lisp
  (dolist (hook '(text-mode-hook))
    (add-hook hook (lambda () (flyspell-mode 1))))
  (dolist (hook '(change-log-mode-hook log-edit-mode-hook))
    (add-hook hook (lambda () (flyspell-mode -1))))
#+END_SRC

*** Enable flyspell for comments in source code

#+BEGIN_SRC emacs-lisp :tangle no
  (add-hook 'prog-mode-hook
            (lambda ()
              (flyspell-prog-mode)))
#+END_SRC

** Set =fill-column= to 80 characters

#+BEGIN_SRC emacs-lisp
(setq-default fill-column 80)
#+END_SRC

** Expand region

#+begin_src emacs-lisp
  (use-package expand-region
    :ensure t
    :config
    (global-set-key (kbd "C-=") 'er/expand-region))
#+end_src

* Coding
** Eglot
Emacs Polyglot is a very useful Emacs LSP client.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package eglot
    :ensure t)
#+END_SRC

** Completion
Configure completion while programming. [[http://cachestocaches.com/2015/8/c-completion-emacs/]]  
*** Irony mode
Configure Irony Mode.

#+BEGIN_SRC emacs-lisp :tangle no
(use-package irony
  :ensure t
  :defer t
  :init
  (add-hook 'c++-mode-hook 'irony-mode)
  (add-hook 'c-mode-hook 'irony-mode)
  (add-hook 'objc-mode-hook 'irony-mode)
  :config
  ;; replace the  `completion-at-point' and `complete-symbol' bindings in
  ;; irony-mode's buffers by irony-mode's function
  (defun my-irony-mode-hook ()
    (define-key irony-mode-map [remap completion-at-point]
      'irony-completion-at-point-async)
    (define-key irony-mode-map [remap complete-symbol]
      'irony-completion-at-point-async))
  (add-hook 'irony-mode-hook 'my-irony-mode-hook)
  (add-hook 'irony-mode-hook 'irony-cbd-autosetup-compile-options))
#+END_SRC

*** Company mode
Configure Company Mode.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package company
    :ensure t
    :defer t
    :init
      (add-hook 'after-init-hook 'global-company-mode)
    :config
      (setq company-dabbrev-downcase 0)
      (setq company-idle-delay 0)
      (setq company-minimum-prefix-length 1)
    :custom
    ;; Activar al escribiri cualquier cosa
    (company-require-match nil "se pueden poner anotaciones")
    (company-tooltip-align-annotation t)
    (company-frontends '(company-pseudo-tooltip-fronend
                         company-echo-metadata-frontend))
    ;; :hook ((prog-mode . company-mode))
    :bind (:map company-active-map
                ("C-n" . company-select-next)
                ("C-p" . company-select-previous)))
#+END_SRC

Configure Company Box Mode.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package company-box
    :hook (company-mode . company-box-mode))
#+END_SRC

Configure Company Postframe

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package company-posframe
    :ensure t
    :config
      (company-posframe-mode 1))
      (require 'desktop)
      (push '(company-posframe-mode . nil)
            desktop-minor-mode-table)
#+END_SRC

** Lisp
*** Slime
Load SLIME package

#+begin_src emacs-lisp
  (use-package slime
    :ensure t
    :init
    ;; (load (expand-file-name "~/quicklisp/slime-helper.el"))
    :config
    ;; Contributors
    (setq slime-contribs '(slime-fancy slime-repl slime-scratch slime-trace-dialog))
    ;; (setq slime-contribs '())
    ;; Select Lisp implementation
    (setq inferior-lisp-program "/usr/local/bin/sbcl")
    (add-hook 'slime-repl-mode-hook 'override-slime-repl-bindings-with-paredit))
#+end_src

*** Paredit

#+begin_src emacs-lisp
  (use-package paredit
    :ensure t
    :init
    (add-hook 'lisp-mode-hook #'enable-paredit-mode)
    (add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
    (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
    (add-hook 'slime-repl-mode-hook #'enable-paredit-mode))
#+end_src

Stop SLIME's REPL from grabbing DEL, which is annoying when backspacing over a
'('

#+begin_src emacs-lisp
  (defun override-slime-repl-bindings-with-paredit ()
    (define-key slime-repl-mode-map
      (read-kbd-macro paredit-backward-delete-key) nil))
#+end_src

*** Highlight
Highligt defined symbols

#+begin_src emacs-lisp
  (use-package highlight-quoted
    :ensure t
    :hook ((emacs-lisp-mode lisp-mode) . highlight-quoted-mode))
#+end_src

Highlight quoted symbols

#+begin_src emacs-lisp
    (use-package highlight-defined
      :ensure t
      :hook ((emacs-lisp-mode lisp-mode) . highlight-defined-mode))
#+end_src

*** Move to begining/end of expression

#+begin_src emacs-lisp
  (defun begining-expression ()
    "Move point to the begining of the expression at point."
    (interactive)
    (backward-up-list 1 t)
    (forward-char))
  (global-set-key (kbd "C-<") 'begining-expression)

  (defun end-expression ()
    "Move point to the end of the expression at point."
    (interactive)
    (backward-up-list 1 t)
    (forward-sexp)
    (backward-char))
  (global-set-key (kbd "C->") 'end-expression)
#+end_src

** LSP Mode
https://vxlabs.com/2018/06/08/python-language-server-with-emacs-and-lsp-mode/

#+begin_src emacs-lisp :tangle no
  (use-package lsp-mode
    :ensure t
    :config

    ;; make sure we have lsp-imenu everywhere we have LSP
    (require 'lsp-imenu)
    (add-hook 'lsp-after-open-hook 'lsp-enable-imenu)  
    ;; get lsp-python-enable defined
    ;; NB: use either projectile-project-root or ffip-get-project-root-directory
    ;;     or any other function that can be used to find the root directory of a project
    (lsp-define-stdio-client lsp-python "python"
                             #'projectile-project-root
                             '("pyls"))

    ;; make sure this is activated when python-mode is activated
    ;; lsp-python-enable is created by macro above 
    (add-hook 'python-mode-hook
              (lambda ()
                (lsp-python-enable)))

    ;; lsp extras
    (use-package lsp-ui
      :ensure t
      :config
      (setq lsp-ui-sideline-ignore-duplicate t)
      (add-hook 'lsp-mode-hook 'lsp-ui-mode))

    (use-package company-lsp
      :config
      (push 'company-lsp company-backends))

    ;; NB: only required if you prefer flake8 instead of the default
    ;; send pyls config via lsp-after-initialize-hook -- harmless for
    ;; other servers due to pyls key, but would prefer only sending this
    ;; when pyls gets initialised (:initialize function in
    ;; lsp-define-stdio-client is invoked too early (before server
    ;; start)) -- cpbotha
    (defun lsp-set-cfg ()
      (let ((lsp-cfg `(:pyls (:configurationSources ("flake8")))))
        ;; TODO: check lsp--cur-workspace here to decide per server / project
        (lsp--set-configuration lsp-cfg)))

    (add-hook 'lsp-after-initialize-hook 'lsp-set-cfg))
#+end_src

** LSP Mode 2
#+begin_src emacs-lisp
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "s-l")

  (use-package lsp-mode
      :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
              (python-mode . lsp)
              ;; if you want which-key integration
              (lsp-mode . lsp-enable-which-key-integration))
      :commands lsp)

  ;; optionally
  (use-package lsp-ui :commands lsp-ui-mode)
  ;; if you are helm user
  ;; (use-package helm-lsp :commands helm-lsp-workspace-symbol)
  ;; if you are ivy user
  ;; (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
  ;; (use-package lsp-treemacs :commands lsp-treemacs-errors-list)

  ;; optionally if you want to use debugger
  (use-package dap-mode)
  ;; (use-package dap-LANGUAGE) to load the dap adapter for your language

  ;; optional if you want which-key integration
  (use-package which-key
      :config
      (which-key-mode))
     
  (setq company-minimum-prefix-length 1
        company-idle-delay 0.0)
#+end_src

* Org Mode
Configuration for Org Mode

#+BEGIN_SRC emacs-lisp
(require 'org)
#+END_SRC

** Load Org Templates
#+BEGIN_SRC emacs-lisp
(require 'org-tempo)
#+END_SRC

** Mappings for Org Mode
Define mappings as suggested in: [[https://orgmode.org/guide/Introduction.html#Introduction]]

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)
#+END_SRC

** Modified variables
**** Indentation
I like storing my Org files flushed to left and using =org-indent=mode= to se
the lines virtually indented.

Disabling =org-adapt-indentation= stops indenting lines to match the headlines.

#+BEGIN_SRC emacs-lisp
(setq org-adapt-indentation nil)
#+END_SRC

Also, I don't call =org-indent-mode= globally, I prefer puting this line in the
files that I'd like to see indented.

#+BEGIN_SRC org
#+STARTUP: indent
#+END_SRC

**** Use property inheritance

#+begin_src emacs-lisp
  (setq org-use-property-inheritance t)
#+end_src

** LaTeX

#+BEGIN_SRC emacs-lisp
(setq org-format-latex-options (plist-put org-format-latex-options :scale 1.2))
#+END_SRC

** Don't reposition text when expanding
#+begin_src emacs-lisp
  (remove-hook 'org-cycle-hook
               #'org-optimize-window-after-visibility-change)
#+end_src
* LaTeX
** Configure AUCTeX

#+BEGIN_SRC emacs-lisp
(use-package auctex
  :defer t
  :ensure t
  :config
  (setq TeX-auto-save t))
#+END_SRC

** Configure Latex Preview Pane

#+BEGIN_SRC emacs-lisp
  (use-package latex-preview-pane
    :ensure t
    :config
    (latex-preview-pane-enable))
#+END_SRC

To use it on the fly, use: =M-x latex-preview-pane-mode=.

** RefTeX

#+begin_src emacs-lisp
  (add-hook 'latex-mode-hook
            (progn
              (reftex-mode)))
#+end_src

* Yasnippet

#+begin_src emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (use-package yasnippet-snippets
      :ensure t)
    (yas-reload-all)
    (yas-global-mode 1))
#+end_src

