.emacs.d/init.el

(setq apropos-do-all t)

(setq ispell-program-name "hunspell")
;; you could set `ispell-dictionary` instead but `ispell-local-dictionary' has higher priority
(setq ispell-dictionary "en_US,es_ES")
;; (setq ispell-local-dictionary "en_US,es_ES")
(setq ispell-hunspell-dictionary-alist '(("en_US,es_ES" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US,es_ES") nil utf-8)))

(dolist (hook '(text-mode-hook))
  (add-hook hook (lambda () (flyspell-mode 1))))
(dolist (hook '(change-log-mode-hook log-edit-mode-hook))
  (add-hook hook (lambda () (flyspell-mode -1))))

(setq-default fill-column 80)

(use-package expand-region
  :ensure t
  :config
  (global-set-key (kbd "C-=") 'er/expand-region))

(use-package slime
  :ensure t
  :init
  ;; (load (expand-file-name "~/quicklisp/slime-helper.el"))
  :config
  ;; Contributors
  (setq slime-contribs '(slime-fancy slime-repl slime-scratch slime-trace-dialog))
  ;; (setq slime-contribs '())
  ;; Select Lisp implementation
  (setq inferior-lisp-program "/usr/local/bin/sbcl")
  (add-hook 'slime-repl-mode-hook 'override-slime-repl-bindings-with-paredit))

(use-package paredit
  :ensure t
  :init
  (add-hook 'lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
  (add-hook 'slime-repl-mode-hook #'enable-paredit-mode))

(defun override-slime-repl-bindings-with-paredit ()
  (define-key slime-repl-mode-map
    (read-kbd-macro paredit-backward-delete-key) nil))

(use-package highlight-quoted
  :ensure t
  :hook ((emacs-lisp-mode lisp-mode) . highlight-quoted-mode))

(use-package highlight-defined
  :ensure t
  :hook ((emacs-lisp-mode lisp-mode) . highlight-defined-mode))

(defun begining-expression ()
  "Move point to the begining of the expression at point."
  (interactive)
  (backward-up-list 1 t)
  (forward-char))
(global-set-key (kbd "C-<") 'begining-expression)

(defun end-expression ()
  "Move point to the end of the expression at point."
  (interactive)
  (backward-up-list 1 t)
  (forward-sexp)
  (backward-char))
(global-set-key (kbd "C->") 'end-expression)

;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
(setq lsp-keymap-prefix "s-l")

(use-package lsp-mode
    :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
            (python-mode . lsp)
            ;; if you want which-key integration
            (lsp-mode . lsp-enable-which-key-integration))
    :commands lsp)

;; optionally
(use-package lsp-ui :commands lsp-ui-mode)
;; if you are helm user
;; (use-package helm-lsp :commands helm-lsp-workspace-symbol)
;; if you are ivy user
;; (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
;; (use-package lsp-treemacs :commands lsp-treemacs-errors-list)

;; optionally if you want to use debugger
(use-package dap-mode)
;; (use-package dap-LANGUAGE) to load the dap adapter for your language

;; optional if you want which-key integration
(use-package which-key
    :config
    (which-key-mode))

(setq company-minimum-prefix-length 1
      company-idle-delay 0.0)

(require 'org)

(require 'org-tempo)

(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)

(setq org-adapt-indentation nil)

(setq org-use-property-inheritance t)

(setq org-format-latex-options (plist-put org-format-latex-options :scale 1.2))

(remove-hook 'org-cycle-hook
             #'org-optimize-window-after-visibility-change)

(use-package auctex
  :defer t
  :ensure t
  :config
  (setq TeX-auto-save t))

(use-package latex-preview-pane
  :ensure t
  :config
  (latex-preview-pane-enable))

(use-package yasnippet
  :ensure t
  :config
  (use-package yasnippet-snippets
    :ensure t)
  (yas-reload-all)
  (yas-global-mode 1))
