.emacs.d/config.org
* Magit

#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :config
    ;; Open magit status
    (global-set-key (kbd "C-x g") 'magit-status)
    ;; Open transient of transients from non-Magit buffers
    ;; Same as pressing h from a Magit buffer
    (global-set-key (kbd "C-x M-g") 'magit-dispatch))
#+end_src

* ERC
Better display margin, avoid some notifications and load notifications and spelling modules.

#+begin_src emacs-lisp
  (use-package erc
    :custom
    (erc-fill-function 'erc-fill-static)
    (erc-fill-static-center 15)
    (erc-track-exclude-types '("JOIN" "MODE" "NICK" "PART" "QUIT"
                               "324" "329" "332" "333" "353" "477"))
    :config
    ;; (add-to-list 'erc-modules 'notifications)
    ;; (add-to-list 'erc-modules 'spelling)
    (erc-services-mode 1)
    (erc-update-modules))
#+end_src

The package =erc-hl-nicks= associates a color with every nick and =erc-image=
allows displaying images on the buffer, without having to click a link.

#+begin_src emacs-lisp
  (use-package erc-hl-nicks
    :after erc)

  (use-package erc-image
    :after erc)
#+end_src

* Ediff
** Don't open additional frames for Ediff

#+begin_src emacs-lisp
  (setq ediff-window-setup-function 'ediff-setup-windows-plain)
#+end_src

* Dired
** Move files between split panes
If another window contains a dired buffer, dired suggest to move files to that
buffer when using =R=.

#+begin_src emacs-lisp
  (setq dired-dwim-target t)
#+end_src

** Human readable file sizes

#+begin_src emacs-lisp
  (setq dired-listing-switches "-alh")
#+end_src
