.emacs.d/init.el

(use-package magit
  :ensure t
  :config
  ;; Open magit status
  (global-set-key (kbd "C-x g") 'magit-status)
  ;; Open transient of transients from non-Magit buffers
  ;; Same as pressing h from a Magit buffer
  (global-set-key (kbd "C-x M-g") 'magit-dispatch))

(use-package erc
  :custom
  (erc-fill-function 'erc-fill-static)
  (erc-fill-static-center 15)
  (erc-track-exclude-types '("JOIN" "MODE" "NICK" "PART" "QUIT"
                             "324" "329" "332" "333" "353" "477"))
  :config
  ;; (add-to-list 'erc-modules 'notifications)
  ;; (add-to-list 'erc-modules 'spelling)
  (erc-services-mode 1)
  (erc-update-modules))

(use-package erc-hl-nicks
  :after erc)

(use-package erc-image
  :after erc)

(setq ediff-window-setup-function 'ediff-setup-windows-plain)

(setq dired-dwim-target t)

(setq dired-listing-switches "-alh")
